In [1]:
import pandas as pd
import numpy as np

# Exercises I

In [ ]:
#   Run python -m pip install pymysql from your 
#   terminal to install pymysql.
#
#   Create a notebook or python script named advanced_dataframes 
#   to do your work in for these exercises.

In [ ]:
#   1. Run python -m pip install pymysql from your terminal
#      to install the mysql client (any folder is fine)

###  D  O  N  E

In [ ]:
#   2. cd into your exercises folder for this module and 
#      run echo env.py >> .gitignore

###  D  O  N  E

In [151]:
#import env

#env.username
#env.username
#env.passw--d

NameError: name 'env' is not defined

In [14]:
#   3. Create a function named get_db_url. It should accept
#      a username, hostname, password, and database name
#      and return a url connection string formatted like in
#      the example at the start of this lesson.

#from env import host, username, password

#def get_db_url(username, hostname, password, db_name):
#    url = (
#        f"mysql -u {username} -h {hostname} {db_name}"
#    )
#    return url


# mysql -u noether_2034 -p -h 157.230.209.171 -t < mysql_introduction.sql
# url = f'mysql+pymysql://{user}:{password}@{host}/employees'

In [ ]:
#import os

# def get_db_url(db, env_file = os.path.exists('env.py')):
#   '''
#    return a formatted string containing username, password
#    host and database for connecting to the mySQL server and the
#    database indicated.
    
#    env_file checks to see if the env.py exists in cwd
    
#    '''
#    if env_file:
#        username, password, host = (env.username, "password", env.host)
#        return f"mysql+pymysql://{username}:{password}@{host}/{db}"
#    else:
#        return 'hello, you need a username and password to get in!'

In [22]:
def get_db_url(db):
    from env import host, username, password
    '''
    return a formatted string containing username, password
    host and database for connecting to the mySQL server and the
    database indicated.
    
    env_file checks to see if the env.py exists in cwd
    
    '''
    username, password, host = (username, password, host)
    
    return f"mysql+pymysql://{username}:{password}@{host}/{db}"

#print(get_db_url('employees'))

In [9]:
#   4. Use your function to obtain a connection to the 
#      employees database.

In [23]:
query = '''
SELECT
    emp_no,
    first_name,
    last_name
FROM employees
WHERE gender = 'F'
LIMIT 100;
'''

In [24]:
url = get_db_url('employees')

In [ ]:
# A C C E S S   S Q L
# PANDAS FUNCTION "read_sql()"

# pd.read_sql(query,url)

In [25]:
test_dataframe = pd.read_sql(query, url)

In [152]:
test_dataframe.head(15)

    emp_no first_name   last_name
0    10002    Bezalel      Simmel
1    10006     Anneke     Preusig
2    10007    Tzvetan   Zielinski
3    10009     Sumant        Peac
4    10010  Duangkaew    Piveteau
5    10011       Mary       Sluis
6    10017  Cristinel   Bouloucos
7    10018   Kazuhide        Peha
8    10023      Bojan  Montemayor
9    10024    Suzette      Pettey
10   10027     Divier     Reistad
11   10032      Jeong     Reistad
12   10040      Weiyi     Meriste
13   10041        Uri      Lenart
14   10042       Magy   Stamatiou

In [ ]:
#   5. Once you have successfully run a query:

#      a. Intentionally make a typo in the database url. 
#         What kind of error message do you see?

#      b. Intentionally make an error in your SQL query.
#         What does the error message look like?

In [ ]:
#   6. Read the employees and titles tables into two separate DataFrames.

In [156]:
url = get_db_url('employees')

In [158]:
query = '''
SELECT
    *
FROM employees
LIMIT 25;
'''

In [159]:
employees = pd.read_sql(query, url)

In [160]:
query = '''
SELECT
    *
FROM titles
LIMIT 25;
'''

In [161]:
titles = pd.read_sql(query, url)

In [ ]:
#   7. How many rows and columns do you have in each DataFrame?
#      Is that what you expected?

In [163]:
employees.shape

(25, 6)

In [164]:
titles.shape

(25, 4)

In [ ]:
#   8. Display the summary statistics for each DataFrame.

In [169]:
employees.describe()

             emp_no
count     25.000000
mean   10013.000000
std        7.359801
min    10001.000000
25%    10007.000000
50%    10013.000000
75%    10019.000000
max    10025.000000

In [170]:
titles.describe()

             emp_no
count     25.000000
mean   10009.360000
std        5.015642
min    10001.000000
25%    10005.000000
50%    10009.000000
75%    10013.000000
max    10018.000000

In [ ]:
#   9. How many unique titles are in the titles DataFrame?

In [166]:
titles.nunique()

emp_no       18
title         5
from_date    25
to_date      12
dtype: int64

In [ ]:
#   10. What is the oldest date in the to_date column?

In [171]:
titles['to_date'].min()

datetime.date(1990, 2, 18)

In [ ]:
#   11. What is the most recent date in the to_date column?

In [173]:
titles['to_date'].max()

datetime.date(9999, 1, 1)

# Exercises II

In [174]:
# 1. Copy the users and roles DataFrames from the examples above.

users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})

In [175]:
# 2. What is the result of using a right join on the DataFrames?

users.merge(roles, how = 'right', on = None, left_on = 'role_id', right_on = 'id')

# Dropped last name without Role

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0     1      admin
1   2.0    joe      2.0     2     author
2   3.0  sally      3.0     3   reviewer
3   4.0   adam      3.0     3   reviewer
4   NaN    NaN      NaN     4  commenter

In [176]:
# 3. What is the result of using an outer join on the DataFrames?
users.merge(roles, how = 'outer', on = None, left_on = 'role_id', right_on = 'id')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0   1.0      admin
1   2.0    joe      2.0   2.0     author
2   3.0  sally      3.0   3.0   reviewer
3   4.0   adam      3.0   3.0   reviewer
4   5.0   jane      NaN   NaN        NaN
5   6.0   mike      NaN   NaN        NaN
6   NaN    NaN      NaN   4.0  commenter

In [ ]:
# 4. What happens if you drop the foreign keys from the DataFrames and try to merge them?

# Commanality of 2 columns is needed between the 2 tables in order to join

# "flying blind"
# effect the relationship between values on the 2 tables

In [ ]:
# user.drop(columns = ['id'])

In [ ]:
# user.drop(columns = ['id'], inplace=True)

In [177]:
# 5. Load the mpg dataset from PyDataset.
from pydataset import data

mpg = data('mpg') # load the dataset and store it in a variable

In [180]:
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
2         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
3         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
4         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
5         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

In [178]:
# 6. Output and read the documentation for the mpg dataset.
data('mpg', show_doc=True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

In [115]:
# 7. How many rows and columns are in the dataset?
mpg.shape

(234, 11)

In [116]:
# 8. Check out your column names and perform any cleanup you may want on them.
mpg.columns

Index(['manufacturer', 'model', 'displ', 'year', 'cyl', 'trans', 'drv', 'cty',
       'hwy', 'fl', 'class'],
      dtype='object')

In [117]:
# 9. Display the summary statistics for the dataset.
mpg.describe()

            displ         year         cyl         cty         hwy
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000

In [118]:
mpg['manufacturer'].unique()

array(['audi', 'chevrolet', 'dodge', 'ford', 'honda', 'hyundai', 'jeep',
       'land rover', 'lincoln', 'mercury', 'nissan', 'pontiac', 'subaru',
       'toyota', 'volkswagen'], dtype=object)

In [181]:
mpg['manufacturer'].nunique()

15

In [126]:
# 10. How many different manufacturers are there?
#mpg['manufacturer'].drop_duplicates().count()
#mpg['manufacturer'].unique()

mpg['manufacturer'].value_counts().count()

15

In [51]:
# 11. How many different models are there?
mpg['model'].drop_duplicates().count()

38

In [182]:
mpg.head(3)

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
2         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
3         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact

In [185]:
# 12. Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.
mpg['mileage_difference'] = mpg['hwy']-mpg['cty']
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10

In [187]:
# 13. Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.
mpg['average_mileage'] = mpg[['hwy','cty']].mean(axis=1)
mpg.head()

# my_first_dataframe['overall_grade'] = my_first_dataframe[["math","english","reading"]].mean(axis=1)

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0

In [191]:
mpg[mpg['trans'].str.contains('auto')].head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0
7,audi,a4,3.1,2008,6,auto(av),f,18,27,p,compact,9,22.5
9,audi,a4 quattro,1.8,1999,4,auto(l5),4,16,25,p,compact,9,20.5

In [192]:
# 14. Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.
mpg['is_automatic'] = mpg['trans'].str.contains('auto')

In [1]:
mpg.head(1)

NameError: name 'mpg' is not defined

In [196]:
# 15. Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

In [197]:
mpg.sort_values('average_mileage', ascending=False).head(1)

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference,average_mileage,is_automatic
222,volkswagen,new beetle,1.9,1999,4,manual(m5),f,35,44,d,subcompact,9,39.5,False

In [ ]:
mpg.sort_values('average_mileage', ascending=False).head(1)

In [199]:
mpg.groupby('manufacturer')['average_mileage'].agg('mean').nlargest(1)

manufacturer
honda    28.5
Name: average_mileage, dtype: float64

In [200]:
mpg.groupby('is_automatic')['average_mileage'].agg('mean').nlargest(1)

is_automatic
False    22.227273
Name: average_mileage, dtype: float64

In [66]:
# 16. Do automatic or manual cars have better miles per gallon?
mpg.sort_values('average_mileage', ascending=False).head(1)

(
    mpg.
    groupby(['is_automatic']).
    average_mileage.
    agg(['max', 'max'])
)


mpg.groupby('is_automatic')['average_mileage'].agg('max')

is_automatic
False    39.5
True     35.0
Name: average_mileage, dtype: float64

# Exercises III

In [32]:
from env import host, username, password

In [27]:
def get_db_url(db):
    '''
    return a formatted string containing username, password
    host and database for connecting to the mySQL server and the
    database indicated.
    
    env_file checks to see if the env.py exists in cwd
    
    '''
    username, password, host = (username, password, host)
    
    return f"mysql+pymysql://{username}:{password}@{host}/{db}"

In [29]:
# SQL SETUP VARIABLES
url_chipotle = get_db_url("chipotle")
query_chipotle = '''
SELECT
    *
FROM orders
'''
dataframe_chipotle = pd.read_sql(query_chipotle, url_chipotle)

In [ ]:
# 1. Use your get_db_url function to help you 
#    explore the data from the chipotle database.

In [33]:
dataframe_chipotle

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
...,...,...,...,...,...,...
4617,4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,4619,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,4622,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

# DONE

In [ ]:
# 2. What is the total price for each order?

In [201]:
dataframe_chipotle['item_price'].head()

0     2.39
1     3.39
2     3.39
3     2.39
4    16.98
Name: item_price, dtype: float64

In [ ]:
dataframe_chipotle['item_price'] = (
    dataframe_chipotle['item_price'].
    str.replace('$','')
)

In [ ]:
dataframe_chipotle['item_price'] = pd.to_numeric(dataframe_chipotle['item_price'])

In [ ]:
#

In [205]:
dataframe_chipotle.dtypes

id                      int64
order_id                int64
quantity                int64
item_name              object
choice_description     object
item_price            float64
order_totals          float64
dtype: object

In [202]:
dataframe_chipotle.head()

,id,order_id,quantity,item_name,choice_description,item_price,order_totals
0,1,1,1,Chips and Fresh Tomato Salsa,nan,2.39,2.39
1,2,1,1,Izze,[Clementine],3.39,3.39
2,3,1,1,Nantucket Nectar,[Apple],3.39,3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,2.39,2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",16.98,33.96

In [209]:
dataframe_chipotle.groupby(['order_id'])['item_name','item_price'].head()

/var/folders/_r/wftd7dk93nj_hbzpqfw4vnsr0000gn/T/ipykernel_91811/1932692536.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  dataframe_chipotle.groupby(['order_id'])['item_name','item_price'].head()

                                  item_name  item_price
0              Chips and Fresh Tomato Salsa        2.39
1                                      Izze        3.39
2                          Nantucket Nectar        3.39
3     Chips and Tomatillo-Green Chili Salsa        2.39
4                              Chicken Bowl       16.98
...                                     ...         ...
4617                          Steak Burrito       11.75
4618                          Steak Burrito       11.75
4619                     Chicken Salad Bowl       11.25
4620                     Chicken Salad Bowl        8.75
4621                     Chicken Salad Bowl        8.75

[4520 rows x 2 columns]

In [76]:
dataframe_chipotle['order_totals'] = dataframe_chipotle['quantity'] * dataframe_chipotle['item_price']

dataframe_chipotle.head()
dataframe_chipotle['order_totals'].sum()

39237.02

In [77]:
# 3. What are the most popular 3 items?

In [210]:
dataframe_chipotle.groupby('item_name')['item_price'].agg('sum').nlargest(3)

item_name
Chicken Bowl       7342.73
Chicken Burrito    5575.82
Steak Burrito      3851.43
Name: item_price, dtype: float64

In [216]:
dataframe_chipotle.groupby('item_name')['item_price'].agg('sum').nlargest(1)

item_name
Chicken Bowl    7342.73
Name: item_price, dtype: float64

In [215]:
dataframe_chipotle['item_name'].value_counts().idxmax()

'Chicken Bowl'

In [81]:
# 4. Which item has produced the most revenue?
dataframe_chipotle.sort_values(by=['order_totals'], ascending=False).head(1)

,id,order_id,quantity,item_name,choice_description,item_price,order_totals
3598,3599,1443,15,Chips and Fresh Tomato Salsa,nan,44.25,663.75

In [83]:
url_employees = get_db_url("employees")
query_employees = '''
SELECT
    *
FROM employees
'''
dataframe_employees = pd.read_sql(query_employees, url_employees)

In [90]:
url_titles = get_db_url("employees")
query_titles = '''
SELECT * FROM titles ;
'''
dataframe_titles = pd.read_sql(query_titles, url_titles)

In [92]:
# 5. Join the employees and titles DataFrames together.

In [ ]:
# dataframe_employees.head()

In [ ]:
# dataframe_titles.head()

In [ ]:
# dataframe_employees.merge(dataframe_titles, how='inner', on=None, left_on='emp_no', right_on='emp_no', left_index=False, right_index=False, indicator=False)

In [101]:
dataframe_employees = dataframe_employees.merge(dataframe_titles, how='inner', on=None, left_on='emp_no', right_on='emp_no', left_index=False, right_index=False, indicator=False)

In [217]:
dataframe_employees.head(3)

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,9999-01-01
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,Staff,1996-08-03,9999-01-01
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,Senior Engineer,1995-12-03,9999-01-01

In [140]:
# 6. For each title, find the hire date of the employee 
#    that was hired most recently with that title.

In [150]:
dataframe_employees.sort_values('hire_date', ascending=False).head()

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date
389997,463807,1964-06-12,Bikash,Covnot,M,2000-01-28,Engineer,2000-02-01,2000-05-19
337630,428377,1957-05-09,Yucai,Gerlach,M,2000-01-23,Engineer,2000-01-23,9999-01-01
442662,499553,1954-05-06,Hideyuki,Delgrande,F,2000-01-22,Engineer,2000-01-22,9999-01-01
182100,222965,1959-08-07,Volkmar,Perko,F,2000-01-13,Senior Staff,2000-01-29,9999-01-01
55137,47291,1960-09-09,Ulf,Flexer,M,2000-01-12,Staff,2000-01-26,9999-01-01

In [ ]:
dataframe_employees.groupby()

In [141]:
dataframe_employees.groupby('title')['hire_date'].agg('max')

title
Assistant Engineer    1999-12-24
Engineer              2000-01-28
Manager               1992-02-05
Senior Engineer       2000-01-01
Senior Staff          2000-01-13
Staff                 2000-01-12
Technique Leader      1999-12-31
Name: hire_date, dtype: object

In [ ]:
# 7. Write the code necessary to create a cross tabulation 
#    of the number of titles by department. (Hint: this will 
#    involve a combination of SQL code to pull the necessary 
#    data and python/pandas code to perform the manipulations.)

In [136]:
url_employees = get_db_url("employees")
query_employees_merged = '''
SELECT *
FROM employees
INNER JOIN dept_emp USING(emp_no)
INNER JOIN titles USING(emp_no)
INNER JOIN departments USING(dept_no)
;
'''

### MERGE

In [137]:
dataframe_employees_merged = pd.read_sql(query_employees_merged, url_employees)

In [138]:
dataframe_employees_merged.head()

,dept_no,emp_no,birth_date,first_name,last_name,gender,hire_date,from_date,to_date,title,from_date,to_date,dept_name
0,d009,10011,1953-11-07,Mary,Sluis,F,1990-01-22,1990-01-22,1996-11-09,Staff,1990-01-22,1996-11-09,Customer Service
1,d009,10038,1960-07-20,Huan,Lortz,M,1989-09-20,1989-09-20,9999-01-01,Senior Staff,1996-09-20,9999-01-01,Customer Service
2,d009,10038,1960-07-20,Huan,Lortz,M,1989-09-20,1989-09-20,9999-01-01,Staff,1989-09-20,1996-09-20,Customer Service
3,d009,10049,1961-04-24,Basil,Tramer,F,1992-05-04,1992-05-04,9999-01-01,Senior Staff,2000-05-04,9999-01-01,Customer Service
4,d009,10049,1961-04-24,Basil,Tramer,F,1992-05-04,1992-05-04,9999-01-01,Staff,1992-05-04,2000-05-04,Customer Service

In [218]:
pd.crosstab(dataframe_employees_merged.title, dataframe_employees_merged.dept_name).T

title,Assistant Engineer,Engineer,Manager,Senior Engineer,Senior Staff,Staff,Technique Leader
dept_name,,,,,,,
Customer Service,298,2362,4,2027,13925,16150,309
Development,7769,58135,2,49326,1247,1424,7683
Finance,0,0,2,0,12139,13929,0
Human Resources,0,0,2,0,12274,14342,0
Marketing,0,0,2,0,13940,16196,0
Production,6445,49649,4,42205,1270,1478,6557
Quality Management,1831,13852,4,11864,0,0,1795
Research,378,2986,2,2570,11637,13495,393
Sales,0,0,2,0,36191,41808,0